In [3]:
import pandas as pd
import csv
import os

In [4]:
path="C:\\Users\\Olga\\Desktop\\docs\\hackathon\\"

In [5]:
simple=pd.read_excel(path+"simple.xlsx")
simple.head()

   base  rate    fee
0     0   3.0   0.00
1  1315   2.7  35.51
2  7556   0.9  68.00
3  4587   1.8  82.57
4  5328   1.5  79.92

In [6]:
len(simple)

100

In [7]:
wl=pd.ExcelFile(path+"with_lookup.xlsx")

In [8]:
wl.sheet_names

['Data', 'Rates']

In [9]:
wld=wl.parse('Data')

In [10]:
wl.parse('Data').head()

   base period start period end   fee
0     0   2021-02-17 2021-10-14  0.00
1  4587   2021-07-13 2021-08-19  8.37
2   470   2021-09-05 2021-11-23  3.05
3  9347   2021-05-20 2021-09-13  8.91
4  8310   2021-01-13 2021-01-31  2.46

In [18]:
wld['Lower limit']=wld['base'].apply(lambda row: (int(row) - int(row)%1000))

In [19]:
wld.head()

   base period start period end   fee  Lower limit
0     0   2021-02-17 2021-10-14  0.00            0
1  4587   2021-07-13 2021-08-19  8.37         4000
2   470   2021-09-05 2021-11-23  3.05            0
3  9347   2021-05-20 2021-09-13  8.91         9000
4  8310   2021-01-13 2021-01-31  2.46         8000

In [16]:
wlr=wl.parse('Rates')
wlr.head()

   Lower limit  Upper limit  Rate
0            0         1000   3.0
1         1000         2000   2.7
2         2000         3000   2.4
3         3000         4000   2.1
4         4000         5000   1.8

In [20]:
wl = pd.merge(wld, 
              wlr, 
              on ='Lower limit', 
              how ='left')

In [21]:
wl.head()

   base period start period end   fee  Lower limit  Upper limit  Rate
0     0   2021-02-17 2021-10-14  0.00            0         1000   3.0
1  4587   2021-07-13 2021-08-19  8.37         4000         5000   1.8
2   470   2021-09-05 2021-11-23  3.05            0         1000   3.0
3  9347   2021-05-20 2021-09-13  8.91         9000       100000   0.3
4  8310   2021-01-13 2021-01-31  2.46         8000         9000   0.6

In [22]:
wl.rename(columns = {'Rate':'rate'}, inplace = True)

In [23]:
wp=pd.ExcelFile(path+"with_period.xlsx")

In [24]:
wp.sheet_names

['Data']

In [25]:
wpd=wp.parse("Data")

In [26]:
len(wpd)

100

In [27]:
wpd.head()

   base  rate period start period end   fee
0     0   3.0   2021-02-17 2021-10-14  0.00
1  4587   1.8   2021-07-13 2021-08-19  8.37
2   470   3.0   2021-09-05 2021-11-23  3.05
3  9347   0.3   2021-05-20 2021-09-13  8.91
4  8310   0.6   2021-01-13 2021-01-31  2.46

In [28]:
wr=pd.ExcelFile(path+"with_reference.xlsx")

In [29]:
wr.sheet_names

['Data', 'Rates']

In [30]:
wrd=wr.parse("Data")
len(wrd)

100

In [31]:
wrd.rename(columns = {'rate ID':'ID'}, inplace = True)

In [32]:
wr.parse("Data").head()

   base                               rate ID period start period end   fee
0     0  313d1da6-b871-4c3c-893b-54bd1c5b8cec   2021-02-17 2021-10-14  0.00
1  4587  f1d64162-1af0-4f79-b9a3-f5247ea07809   2021-07-13 2021-08-19  8.37
2   470  313d1da6-b871-4c3c-893b-54bd1c5b8cec   2021-09-05 2021-11-23  3.05
3  9347  240ee602-ad4f-4792-8ca8-ab813a2ea6b3   2021-05-20 2021-09-13  8.91
4  8310  1e760cd7-30f5-4e7b-a77e-3e678116a82a   2021-01-13 2021-01-31  2.46

In [33]:
wrr=wr.parse("Rates")

In [36]:
wrr.head()

                                     ID  Rate
0  313d1da6-b871-4c3c-893b-54bd1c5b8cec   3.0
1  5a3eb9fa-f7b5-4e44-8506-c4359050f980   2.7
2  1f1f54f1-6263-496c-9dbf-72fa5deef60f   2.4
3  2e88dfaa-e4ae-438b-90b3-b9af1e99e789   2.1
4  f1d64162-1af0-4f79-b9a3-f5247ea07809   1.8

In [37]:
wr = pd.merge(wrd, 
                     wrr, 
                     on ='ID', 
                     how ='left')

In [38]:
wr.head()

,base,ID,period start,period end,fee,Rate
0,0,313d1da6-b871-4c3c-893b-54bd1c5b8cec,2021-02-17,2021-10-14,0.00,3.0
1,4587,f1d64162-1af0-4f79-b9a3-f5247ea07809,2021-07-13,2021-08-19,8.37,1.8
2,470,313d1da6-b871-4c3c-893b-54bd1c5b8cec,2021-09-05,2021-11-23,3.05,3.0
3,9347,240ee602-ad4f-4792-8ca8-ab813a2ea6b3,2021-05-20,2021-09-13,8.91,0.3
4,8310,1e760cd7-30f5-4e7b-a77e-3e678116a82a,2021-01-13,2021-01-31,2.46,0.6

In [39]:
wr.rename(columns = {'Rate':'rate'}, inplace = True)

In [40]:
wld[["base",'fee']].equals(wpd[["base",'fee']])

True

In [41]:
wpd[["base",'period start', 'period end','fee']].equals(wrd[["base",'period start', 'period end','fee']])

True

In [42]:
wld[["base",'fee']].equals(simple[["base",'fee']])

False

In [45]:
wpd[["base",'period start', 'period end','fee','rate']].equals(wr[["base",'period start', 'period end','fee','rate']])

True

In [47]:
wpd[["base",'period start', 'period end','fee','rate']].equals(wl[["base",'period start', 'period end','fee','rate']])

True

In [ ]:
#!!!3 datasets are exactly the same except the simple one